Revit 2026 API

# TextRange(Int32, Int32) Constructor

---

Constructs a TextRange with input start and length.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TextRange(
	int start,
	int length
)
```
```vb
Public Sub New (
	start As Integer,
	length As Integer
)
```
```cpp
public:
TextRange(
	int start,
	int length
)
```
```fsharp
new :
        start : int *
        length : int -> TextRange
```

#### Parameters

start Int32

length Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The given value for start is negative. -or- The given value for length is negative. |

The input value for start as well as length should not be negative.

#### Reference

TextRange Class

TextRange Overload

Autodesk.Revit.DB Namespace